# 3. Задайте список из n чисел, заполненный по формуле (1 + 1/n) ** n 
# и выведите на экран их сумму.
# Для n = 6: [2, 2, 2, 2, 2, 3] -> 13
n = int(input())
list = []
sum = 0
for i in range (1,n+1):
    list.append (round((1+1/i)**i))
    sum += list[i-1]
print(f"Для n = {n} список: {list} сумма всех элементов {sum}")