# 3. Напишите программу, в которой пользователь будет задавать две
# строки , программа определять количество вхождений одной строки в другой.
line_1 = input()
line_2 = input()
print(line_1.count(line_2))
